# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
# (словари в помощь)



def code_morse(text):
    dict_morse = {
        'A': '.-', 'J': '.---', 'S': '...', '1': '.----',
        'B': '-...', 'K': '.-.', 'T': '-', '2': '..---',
        'C': '-.-.', 'L': '.-..', 'U': '..-', '3': '...--',
        'D': '-..', 'M': '--', 'V': '...-', '4': '....-',
        'E': '.', 'N': '-.', 'W': '.--', '5': '-..',
        'F': '..-.', 'O': '---', 'X': '-..-', '6': '-....',
        'G': '--.', 'P': '.--.', 'Y': '-.--', '7': '--...',
        'H': '....', 'Q': '--.-', 'Z': '--..', '8': '---..',
        'I': '..', 'R': '.-.', '0': '-----', '9': '----.',
    }

    encode_text = ''

    for char in text.upper():
        if char in dict_morse:
            encode_text += dict_morse.get(char) + ' '
        elif char == ' ':
            encode_text += '   '

    return encode_text

res = code_morse('Hello World')

print(res)